name: "postprocess"
backend: "python"
max_batch_size: 0 
input [
{
    name: "postprocess_input"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1 ]
},

{
    name: "postprocess_dims"
    data_type: TYPE_INT32
    dims: [ -1 ]
}


]
 
output [
{
    name: "postprocess_output"
    data_type: TYPE_FP32
    dims: [ -1]
}
]

