name: "preprocess"
backend: "python"
max_batch_size: 0 
input [
{
    name: "preprocess_input"
    data_type: TYPE_UINT8
    dims: [ -1 ,-1,-1]
}
]
 
output [
{
    name: "preprocess_output"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1, -1]
}


]

