name: "ensemble_model"
platform: "ensemble"

input [
  {
    name: "ensemble_input"
    data_type: TYPE_UINT8
    dims: [ -1,-1,-1 ]
  },
  {
    name: "ensemble_dims"
    data_type: TYPE_INT32
    dims: [ -1 ]
  }

]
output [
  {
    name: "ensemble_output"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: -1
      input_map {
        key: "preprocess_input"
        value: "ensemble_input"
      }
      output_map {
        key: "preprocess_output"
        value: "preprocessed_image"
      }
      
 
    },

    {
      model_name: "yolo"
      model_version: -1
      input_map {
        key: "images"
        value: "preprocessed_image"
      }
      output_map {
        key: "output0"
        value: "yolo_output"
      }
    },

    {
      model_name: "dims"
      model_version: -1
      input_map {
        key: "dims_input"
        value: "ensemble_dims"
      }
      output_map {
        key: "dims_output"
        value: "dims_of_output"
      }
    },


    {
      model_name: "postprocess"
      model_version: -1
      input_map {
        key: "postprocess_input"
        value: "yolo_output"
      }

      input_map {
        key: "postprocess_dims"
        value: "dims_of_output"
      }


      output_map {
        key: "postprocess_output"
        value: "ensemble_output"
      }
    }
    
   
    
  ]
}
   